ubuntu_setup&update.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>软件安装、升级和清理</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="软件安装、升级和清理"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-11 Wed"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content="Ubuntu"/>
<meta name="keywords" content="Wiki"/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./ubuntu_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">软件安装、升级和清理</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 软件包</a>
<ul>
<li><a href="#sec-1-1">1.1 查看软件xxx安装内容</a></li>
<li><a href="#sec-1-2">1.2 查找软件库中的软件</a></li>
<li><a href="#sec-1-3">1.3 显示系统安装包的统计信息</a></li>
<li><a href="#sec-1-4">1.4 显示系统全部可用包的名称</a></li>
<li><a href="#sec-1-5">1.5 显示包的信息</a></li>
<li><a href="#sec-1-6">1.6 查询软件xxx依赖哪些包</a></li>
</ul>
</li>
<li><a href="#sec-2">2 系统更新和升级</a>
<ul>
<li><a href="#sec-2-1">2.1 增加一个光盘源</a></li>
<li><a href="#sec-2-2">2.2 系统更新</a></li>
<li><a href="#sec-2-3">2.3 增加一个ppa源</a></li>
<li><a href="#sec-2-4">2.4 系统升级</a></li>
</ul>
</li>
<li><a href="#sec-3">3 备份与还原</a>
<ul>
<li><a href="#sec-3-1">3.1 备份当前系统安装的所有包的列表</a></li>
<li><a href="#sec-3-2">3.2 从上面备份的安装包的列表文件恢复所有包</a></li>
</ul>
</li>
<li><a href="#sec-4">4 软件包清理</a>
<ul>
<li><a href="#sec-4-1">4.1 清除所有已删除包的残馀配置文件</a></li>
<li><a href="#sec-4-2">4.2 清理旧版本的软件缓存</a></li>
<li><a href="#sec-4-3">4.3 清理所有软件缓存</a></li>
<li><a href="#sec-4-4">4.4 删除系统不再使用的孤立软件</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 软件包</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 查看软件xxx安装内容</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="example">dpkg -L xxx 
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 查找软件库中的软件</h3>
<div class="outline-text-3" id="text-1-2">





<pre class="example">apt-cache search 正则表达式
或
aptitude search 软件包
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 显示系统安装包的统计信息</h3>
<div class="outline-text-3" id="text-1-3">





<pre class="example">apt-cache stats
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 显示系统全部可用包的名称</h3>
<div class="outline-text-3" id="text-1-4">





<pre class="example">apt-cache pkgnames
</pre>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 显示包的信息</h3>
<div class="outline-text-3" id="text-1-5">





<pre class="example">apt-cache show k3b
</pre>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 查询软件xxx依赖哪些包</h3>
<div class="outline-text-3" id="text-1-6">





<pre class="example">apt-cache depends xxx
</pre>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 系统更新和升级</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 增加一个光盘源</h3>
<div class="outline-text-3" id="text-2-1">





<pre class="example">sudo apt-cdrom add
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 系统更新</h3>
<div class="outline-text-3" id="text-2-2">





<pre class="example">sudo apt-get update (这一步更新包列表)
</pre>



<pre class="example">sudo apt-get dist-upgrade (这一步安装所有可用更新)
或者
sudo apt-get upgrade (这一步安装应用程序更新，不安装新内核等)
</pre>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 增加一个ppa源</h3>
<div class="outline-text-3" id="text-2-3">





<pre class="example">sudo add-apt-repository ppa:user/ppa-name
#使用 ppa 的地址替换 ppa:user/ppa-name
</pre>


</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 系统升级</h3>
<div class="outline-text-3" id="text-2-4">


<ol>
<li>这里指的是版本间的升级，例如 9.04-&gt;10.04。

</li>
<li>使用该升级方式通常需要使用 backports 源。
</li>
</ol>





<pre class="example">sudo apt-get update
sudo apt-get install update-manager-core
sudo do-release-upgrade
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 备份与还原</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 备份当前系统安装的所有包的列表</h3>
<div class="outline-text-3" id="text-3-1">





<pre class="example">dpkg --get-selections | grep -v deinstall &gt; ~/somefile
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 从上面备份的安装包的列表文件恢复所有包</h3>
<div class="outline-text-3" id="text-3-2">





<pre class="example">dpkg --set-selections &lt; ~/somefile
sudo dselect
</pre>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 软件包清理</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 清除所有已删除包的残馀配置文件</h3>
<div class="outline-text-3" id="text-4-1">





<pre class="example">dpkg -l |grep ^rc|awk '{print $2}' |sudo xargs dpkg -P 
</pre>


<p>
    如果报如下错误，证明你的系统中没有残留配置文件了，无须担心。
</p>



<p><textarea cols="80" rows="7">dpkg: --purge needs at least one package name argument

Type dpkg --help for help about installing and deinstalling packages [*];
Use `dselect' or `aptitude' for user-friendly package management;
Type dpkg -Dhelp for a list of dpkg debug flag values;
Type dpkg --force-help for a list of forcing options;
Type dpkg-deb --help for help about manipulating *.deb files;
Type dpkg --license for copyright license and lack of warranty (GNU GPL) [*].
Options marked [*] produce a lot of output - pipe it through `less' or `more' !
</textarea>
</p>



</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 清理旧版本的软件缓存</h3>
<div class="outline-text-3" id="text-4-2">





<pre class="example">sudp apt-get autoclean
</pre>


</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 清理所有软件缓存</h3>
<div class="outline-text-3" id="text-4-3">





<pre class="example">sudo apt-get clean
</pre>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 删除系统不再使用的孤立软件</h3>
<div class="outline-text-3" id="text-4-4">





<pre class="example">sudo apt-get autoremove
</pre>



</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-11 Wed</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
